# POSTTEST 2 DATASET

Alan Nuzulan

2009106032

Kecerdasan Buatan A1 2020

In [26]:
import numpy as np
import pandas as pd
from tabulate import tabulate

## TAMPIL DATASET

In [27]:
dataset = pd.read_csv('Stroke.csv')
dataset

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
...,...,...,...,...,...,...,...,...,...,...,...,...
5105,18234,Female,80.0,1,0,Yes,Private,Urban,83.75,NaN,never smoked,0
5106,44873,Female,81.0,0,0,Yes,Self-employed,Urban,125.20,40.0,never smoked,0
5107,19723,Female,35.0,0,0,Yes,Self-employed,Rural,82.99,30.6,never smoked,0
5108,37544,Male,51.0,0,0,Yes,Private,Rural,166.29,25.6,formerly smoked,0
5109,44679,Female,44.0,0,0,Yes,Govt_job,Urban,85.28,26.2,Unknown,0

# INFO DATASET
Jumlah record, Nama attribute, Jumlah attribute dengan tipe objek, Jumlah attribute dengan tipe
angka.

In [28]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5110 entries, 0 to 5109
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5110 non-null   int64
 1   gender             5110 non-null   object
 2   age                5110 non-null   float64
 3   hypertension       5110 non-null   int64
 4   heart_disease      5110 non-null   int64
 5   ever_married       5110 non-null   object
 6   work_type          5110 non-null   object
 7   Residence_type     5110 non-null   object
 8   avg_glucose_level  5110 non-null   float64
 9   bmi                4909 non-null   float64
 10  smoking_status     5110 non-null   object
 11  stroke             5110 non-null   int64
dtypes: float64(3), int64(4), object(5)
memory usage: 479.2+ KB

## JUMLAH RECORD

In [29]:
Jumlah_Record = len(dataset.index)
print("Jumlah Record", Jumlah_Record)

Jumlah Record 5110

**NAMA ATRIBUT**

In [30]:
Data_Atribut = list(dataset.columns)
Nama_Atribut = "\n".join(Data_Atribut)
print("Nama Atribut :\n",Nama_Atribut)

Nama Atribut :
 id
gender
age
hypertension
heart_disease
ever_married
work_type
Residence_type
avg_glucose_level
bmi
smoking_status
stroke

**JUMLAH ATRIBUT**

In [31]:
Jumlah_Atribut = dataset.shape[1]
print("Jumlah Atribut", Jumlah_Atribut)

Jumlah Atribut 12

**ATRIBUT TIPE OBJEK**

In [32]:
Objek = len(dataset.dtypes[dataset.dtypes == 'object'])
print("Jumlah Atribut dengan tipe objek =", Objek)

Jumlah Atribut dengan tipe objek = 5

**ATRIBUT TIPE ANGKA**

In [33]:
Int = len(dataset.dtypes[dataset.dtypes == 'int64'])
Float = len(dataset.dtypes[dataset.dtypes == 'float64'])
Angka = Int + Float
print("Jumlah Atribut dengan tipe objek =", Angka)

Jumlah Atribut dengan tipe objek = 7

**ATRIBUT NILAI NULL**

In [34]:
Null = dataset.isnull().any().sum()
print("Jumlah Atribut yang memiliki nilai null =", Null)

Jumlah Atribut yang memiliki nilai null = 1

# TAMPILAN DALAM DICTIONARY

In [35]:
Dict = {
    "Jumlah Record" : [Jumlah_Atribut],
    "Nama Atribut":[Nama_Atribut],
    "Atribut Tipe Object" : [Objek],
    "Atribut Tipe Angka" : [Angka],
    "Atribut Nilai NULL" : [Null],
}

tabel = pd.DataFrame(Dict)
print(tabulate(tabel, headers='keys', tablefmt='psql', showindex=False))

+-----------------+-------------------+-----------------------+----------------------+----------------------+
|   Jumlah Record | Nama Atribut      |   Atribut Tipe Object |   Atribut Tipe Angka |   Atribut Nilai NULL |
|-----------------+-------------------+-----------------------+----------------------+----------------------|
|              12 | id                |                     5 |                    7 |                    1 |
|                 | gender            |                       |                      |                      |
|                 | age               |                       |                      |                      |
|                 | hypertension      |                       |                      |                      |
|                 | heart_disease     |                       |                      |                      |
|                 | ever_married      |                       |                      |                      |
|                 | work_type         |                       |                      |                      |
|                 | Residence_type    |                       |                      |                      |
|                 | avg_glucose_level |                       |                      |                      |
|                 | bmi               |                       |                      |                      |
|                 | smoking_status    |                       |                      |                      |
|                 | stroke            |                       |                      |                      |
+-----------------+-------------------+-----------------------+----------------------+----------------------+

## Rata-rata, Standar deviasi, Nilai minimum, Nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

In [36]:
desc = dataset.describe()
desc.rename(index = {"count": "Jumlah Data","Mean": "Rata Rata","std": "Standar Deviasi", "min": "Nilai Minimum", 
                     "25%": "Q1", "50%": "Q2", "75%": "Q3", "max": "Nilai Maksimal"},inplace = True)
desc

,id,age,hypertension,heart_disease,avg_glucose_level,bmi,stroke
Jumlah Data,5110.000000,5110.000000,5110.000000,5110.000000,5110.000000,4909.000000,5110.000000
mean,36517.829354,43.226614,0.097456,0.054012,106.147677,28.893237,0.048728
Standar Deviasi,21161.721625,22.612647,0.296607,0.226063,45.283560,7.854067,0.215320
Nilai Minimum,67.000000,0.080000,0.000000,0.000000,55.120000,10.300000,0.000000
Q1,17741.250000,25.000000,0.000000,0.000000,77.245000,23.500000,0.000000
Q2,36932.000000,45.000000,0.000000,0.000000,91.885000,28.100000,0.000000
Q3,54682.000000,61.000000,0.000000,0.000000,114.090000,33.100000,0.000000
Nilai Maksimal,72940.000000,82.000000,1.000000,1.000000,271.740000,97.600000,1.000000

# NILAI KORELASI

In [37]:
dataset.corr()

,id,age,hypertension,heart_disease,avg_glucose_level,bmi,stroke
id,1.000000,0.003538,0.003550,-0.001296,0.001092,0.003084,0.006388
age,0.003538,1.000000,0.276398,0.263796,0.238171,0.333398,0.245257
hypertension,0.003550,0.276398,1.000000,0.108306,0.174474,0.167811,0.127904
heart_disease,-0.001296,0.263796,0.108306,1.000000,0.161857,0.041357,0.134914
avg_glucose_level,0.001092,0.238171,0.174474,0.161857,1.000000,0.175502,0.131945
bmi,0.003084,0.333398,0.167811,0.041357,0.175502,1.000000,0.042374
stroke,0.006388,0.245257,0.127904,0.134914,0.131945,0.042374,1.000000

# Attribute bertipe angka menjadi desimal 3 angka dibelakang koma

Menggunakan atribut id

In [38]:
dataset['id']*0.001

0        9.046
1       51.676
2       31.112
3       60.182
4        1.665
         ...
5105    18.234
5106    44.873
5107    19.723
5108    37.544
5109    44.679
Name: id, Length: 5110, dtype: float64

# 10 Record pertama bertipe Angka

In [39]:
numerics = [ 'int64', 'float64']
number = dataset.select_dtypes(include=numerics).copy()
number.head(10)

      id   age  hypertension  heart_disease  avg_glucose_level   bmi  stroke
0   9046  67.0             0              1             228.69  36.6       1
1  51676  61.0             0              0             202.21   NaN       1
2  31112  80.0             0              1             105.92  32.5       1
3  60182  49.0             0              0             171.23  34.4       1
4   1665  79.0             1              0             174.12  24.0       1
5  56669  81.0             0              0             186.21  29.0       1
6  53882  74.0             1              1              70.09  27.4       1
7  10434  69.0             0              0              94.39  22.8       1
8  27419  59.0             0              0              76.15   NaN       1
9  60491  78.0             0              0              58.57  24.2       1

# Menyimpan dataset dengan attribute bertipe angka ke dalam file CSV.

In [40]:
number.to_csv('Stroke_Angka.csv')